Revit 2023 API
ImporterIFC Members
The ImporterIFC type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ImporterIFC
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetOptions
 Gets the collection of named options set by the importer client.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ProcessIFCProject(IFCAnyHandle)
 The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements.
ProcessIFCProject(IFCAnyHandle, IDictionary<IFCAnyHandle, ElementId>)
SetFile
 Sets the handle to the IFC file being created during this import operation.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Document
 Gets the document associated with the import.
FullFileName
 The full file name of the IFC file to be import.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace